Catalogs/Д_СтатьиОборотки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Д_СтатьиОборотки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазницаЧА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Счета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОстатка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УЧ_ВидОстаткаПоСчету</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасшифровкаСубконто1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасшифровкаПоПредприятиям</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/УЧ_ВидОстаткаПоСчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>УЧ_ВидОстаткаПоСчету</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебет</Name>
					<Comment>Нам должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Мы должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДебетСвернутый</Name>
					<Comment>Нам должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитСвернутый</Name>
					<Comment>Мы должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДебетРазвернутый</Name>
					<Comment>Нам должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитРазвернутый</Name>
					<Comment>Мы должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДебетСвернутыйСубконто1</Name>
					<Comment>Нам должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитСвернутыйСубконто1</Name>
					<Comment>Мы должны</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Д_СтатьиОборотки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СчетаВидОстаткаПриИзменении(Элемент)
	МассивНедоступных = Новый Массив;
	МассивНедоступных.Добавить(ПредопределенноеЗначение("Перечисление.УЧ_ВидОстаткаПоСчету.ДебетСвернутыйСубконто1"));
	МассивНедоступных.Добавить(ПредопределенноеЗначение("Перечисление.УЧ_ВидОстаткаПоСчету.ДебетРазвернутый"));
	МассивНедоступных.Добавить(ПредопределенноеЗначение("Перечисление.УЧ_ВидОстаткаПоСчету.КредитРазвернутый"));
	МассивНедоступных.Добавить(ПредопределенноеЗначение("Перечисление.УЧ_ВидОстаткаПоСчету.КредитСвернутыйСубконто1"));
	
	Если МассивНедоступных.Найти(Элементы.Счета.ТекущиеДанные.ВидОстатка) = Неопределено Тогда
		Элементы.Счета.ТекущиеДанные.РасшифровкаСубконто1 = Ложь;	
	КонецЕсли;
КонецПроцедуры
